Revit 2027 API
UIControlledApplication.RegisterDockablePane Method
Adds a new dockable pane to the Revit user interface.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RegisterDockablePane(
	DockablePaneId id,
	string title,
	IDockablePaneProvider provider
)
Public Sub RegisterDockablePane (
	id As DockablePaneId,
	title As String,
	provider As IDockablePaneProvider
)
public:
void RegisterDockablePane(
	DockablePaneId^ id,
	String^ title,
	IDockablePaneProvider^ provider
)
member RegisterDockablePane :
        id : DockablePaneId *
        title : string *
        provider : IDockablePaneProvider -> unit
Parameters
id DockablePaneId
Unique identifier for the new pane.
title String
String to use for the pane caption.
provider IDockablePaneProvider
Your add-in's implementation of the IDockablePaneProvider interface.
Exceptions
Exception | Condition
ArgumentException | Thrown if a dockable pane with identifier %id% has already been registered.
Example
public Result OnStartup(UIControlledApplication application)
{
   // Create our pane provider and register it with the application
   PaneProvider prov = new PaneProvider();
   DockablePaneId id = new DockablePaneId(Guid.NewGuid());
   application.RegisterDockablePane(id, "test", prov);
   return Result.Succeeded;
}
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace